### 2.2 데이터 프레임(DataFrame)

In [1]:
import numpy as np
import pandas as pd

- 생성 방법1
    - 2차원 데이터, 컬럼, 인덱스

In [3]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),        # 2차원 데이터
    columns = list('XYZ'),          # 컬럼명 : list('XYZ') = ['X', 'Y', 'Z']
    index = list('abcd')            # 인덱스
)
df1

     X   Y   Z
a   79  75  83
b   45  92  50
c  100  46  46
d   61  50  58

- 생성 방법2
    - 딕셔너리의 리스트

In [4]:
data = [
    {'X':67, 'Y':50, 'Z':45},
    {'X':72, 'Y':88, 'Z':79},
    {'X':71, 'Y':78, 'Z':57},
    {'X':82, 'Y':75, 'Z':98}
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 생성방법 3
    - 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [6]:
data = {
    'X': [67, 72, 71, 82],
    'Y': [50, 88, 78, 75],
    'Z': [45, 79, 57, 98]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 여러가지 타입이 혼합된

In [3]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [4]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [5]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [6]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='항목')

In [7]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

- 연습 문제 4.1.2
    - 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
    - 1) 열의 갯수와 행의 갯수가 각각 5개 이상
    - 2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함

In [14]:
data = np.random.randint(1, 1000, 25).reshape(5, 5)
df4 = pd.DataFrame(data, columns=list('ABCDE'), index=list('ijklm'))
df4

     A    B    C    D    E
i  369  445   78  456  514
j  144  845  880  610  578
k  225   36   88  416  391
l   52  434  342  348  843
m  860   52  357  655  134

In [9]:
data = []
for i in range(5):
    d = {
        '문자열' : chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)),
        '정수1' : np.random.randint(1, 7),
        '정수2' : np.random.randint(40, 101),
        '정수3' : np.random.randint(1, 100) * 1000,
        '실수' : round(np.random.random(), 4)
    }
    data.append(d)
df4 = pd.DataFrame(data, index=list('vwxyz'))
df4

  문자열  정수1  정수2    정수3      실수
v  SZ    1   81  74000  0.3071
w  DO    1   51  50000  0.3195
x  TA    2   85  45000  0.6641
y  XH    5   84  98000  0.2660
z  HX    3   75  10000  0.7015

- 전치(Trnaspose)

In [38]:
df4.T

          v       w       x       y       z
문자열      PL      NV      HL      BO      BG
정수1       5       2       1       1       2
정수2      58      78      97      59      60
정수3   59000    1000   56000   61000   20000
실수   0.7765  0.2954  0.4606  0.6247  0.7631

- 열 데이터의 갱신, 추가

In [11]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [12]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [13]:
# 열 이름이 있으면 갱신, 없으면 추가
df['Eng name'] = ['Seoul', 'Busan', 'Incheon', 'Daegu']
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율 Eng name
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83    Seoul
부산  경상권  3448737  3393191  3512547  3655437           1.63    Busan
인천  수도권  2890451  2632035  2517680  2466338           9.82  Incheon
대구  경상권  2466052  2431774  2456016  2473990           1.41    Daegu

- 열 삭제

In [14]:
del df['2000']

In [15]:
df.drop(columns=['2005', '2010'], inplace=True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon
대구  경상권  2466052           1.41    Daegu

In [16]:
# 행을 지울 때
df.drop(index=['대구'], inplace=True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon

- 열 인덱싱

In [17]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
Name: 지역, dtype: object

In [18]:
# 열 이름이 리스트로 감싸져 있으면 데이터프레임 반환
df[['지역']]

항목   지역
도시
서울  수도권
부산  경상권
인천  수도권

In [19]:
df[['지역', 'Eng name']]

항목   지역 Eng name
도시
서울  수도권    Seoul
부산  경상권    Busan
인천  수도권  Incheon

- 개별 인덱싱

In [20]:
# 데이터프레임[열 이름][행 인덱스]
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [21]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없음.
df.2015['서울']

SyntaxError: invalid syntax (2785195342.py, line 2)

- 연습문제 4.1.3

In [2]:
data = [
    {'국어' : 80, '영어' : 90, '수학' : 90},
    {'국어' : 90, '영어' : 70, '수학' : 60},
    {'국어' : 70, '영어' : 60, '수학' : 80},
    {'국어' : 30, '영어' : 40, '수학' : 70},
]
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df6 = pd.DataFrame(data, columns=columns, index=index)
df6

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [54]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df6['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [55]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df6[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [60]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df6['평균'] = round((df6['국어'] + df6['영어'] + df6['수학']) / 3, 2)

In [7]:
df6['평균'] = (df6.sum(axis=1)/len(df6.columns)).round(2)
df6

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [8]:
del df6['평균']

In [9]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산
df6['영어']['방자'] = 80

In [10]:
df6['평균'] = (df6.sum(axis=1)/len(df6.columns)).round(2)

In [11]:
df6

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [19]:
import warnings
warnings.filterwarnings('ignore')

In [73]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df7 = df6.T

In [22]:
df6[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [18]:
df6['춘향':'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [14]:
df6.loc[['춘향']]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [15]:
df6.T[['춘향']].T

      국어    영어    수학     평균
춘향  80.0  90.0  90.0  86.67

In [21]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df6.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [84]:
df6[:]

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [85]:
df6.values

array([[80.  , 90.  , 90.  , 86.67],
       [90.  , 70.  , 60.  , 73.33],
       [70.  , 60.  , 80.  , 70.  ],
       [30.  , 80.  , 70.  , 60.  ]])